---
kind: property
id: P:Autodesk.Revit.DB.RevolvedSurface.YDir
source: html/4344a317-7751-0c0d-7feb-285b50f91db7.htm
---
# Autodesk.Revit.DB.RevolvedSurface.YDir Property

X axis of the local coordinate system associated with this revolved surface.

## Syntax (C#)
```csharp
public XYZ YDir { get; }
```